{"class_name": "Model", "keras_version": "2.1.5", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 40, 150, 150, 3], "name": "input_1", "sparse": false}, "inbound_nodes": [], "name": "input_1"}, {"class_name": "Conv3D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "Conv3d_1a_7x7_conv", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": false, "data_format": "channels_last", "padding": "same", "strides": [2, 2, 2], "dilation_rate": [1, 1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [7, 7, 7]}, "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "Conv3d_1a_7x7_conv"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "Conv3d_1a_7x7_bn", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "axis": 4, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["Conv3d_1a_7x7_conv", 0, 0, {}]]], "name": "Conv3d_1a_7x7_bn"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": false, "name": "Conv3d_1a_7x7"}, "inbound_nodes": [[["Conv3d_1a_7x7_bn", 0, 0, {}]]], "name": "Conv3d_1a_7x7"}, {"class_name": "MaxPooling3D", "config": {"name": "MaxPool2d_2a_3x3", "trainable": false, "data_format": "channels_last", "pool_size": [1, 3, 3], "padding": "same", "strides": [1, 2, 2]}, "inbound_nodes": [[["Conv3d_1a_7x7", 0, 0, {}]]], "name": "MaxPool2d_2a_3x3"}, {"class_name": "Conv3D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "Conv3d_2b_1x1_conv", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": false, "data_format": "channels_last", "padding": "same", "strides": [1, 1, 1], "dilation_rate": [1, 1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1, 1]}, "inbound_nodes": [[["MaxPool2d_2a_3x3", 0, 0, {}]]], "name": "Conv3d_2b_1x1_conv"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "Conv3d_2b_1x1_bn", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "axis": 4, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["Conv3d_2b_1x1_conv", 0, 0, {}]]], "name": "Conv3d_2b_1x1_bn"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": false, "name": "Conv3d_2b_1x1"}, "inbound_nodes": [[["Conv3d_2b_1x1_bn", 0, 0, {}]]], "name": "Conv3d_2b_1x1"}, {"class_name": "Conv3D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "Conv3d_2c_3x3_conv", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": false, "data_format": "channels_last", "padding": "same", "strides": [1, 1, 1], "dilation_rate": [1, 1, 1], "kernel_regularizer": null, "filters": 192, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3, 3]}, "inbound_nodes": [[["Conv3d_2b_1x1", 0, 0, {}]]], "name": "Conv3d_2c_3x3_conv"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "Conv3d_2c_3x3_bn", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "axis": 4, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["Conv3d_2c_3x3_conv", 0, 0, {}]]], "name": "Conv3d_2c_3x3_bn"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": false, "name": "Conv3d_2c_3x3"}, "inbound_nodes": [[["Conv3d_2c_3x3_bn", 0, 0, {}]]], "name": "Conv3d_2c_3x3"}, {"class_name": "MaxPooling3D", "config": {"name": "MaxPool2d_3a_3x3", "trainable": false, "data_format": "channels_last", "pool_size": [1, 3, 3], "padding": "same", "strides": [1, 2, 2]}, "inbound_nodes": [[["Conv3d_2c_3x3", 0, 0, {}]]], "name": "MaxPool2d_3a_3x3"}, {"class_name": "Conv3D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "Conv3d_3b_1a_1x1_conv", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": false, "data_format": "channels_last", "padding": "same", "strides": [1, 1, 1], "dilation_rate": [1, 1, 1], "kernel_regularizer": null, "filters": 96, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1, 1]}, "inbound_nodes": [[["MaxPool2d_3a_3x3", 0, 0, {}]]], "name": "Conv3d_3b_1a_1x1_conv"}, {"class_name": "Conv3D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "Conv3d_3b_2a_1x1_conv", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": false, "data_format": "channels_last", "padding": "same", "strides": [1, 1, 1], "dilation_rate": [1, 1, 1], "kernel_regularizer": null, "filters": 16, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1, 1]}, "inbound_nodes": [[["MaxPool2d_3a_3x3", 0, 0, {}]]], "name": "Conv3d_3b_2a_1x1_conv"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "Conv3d_3b_1a_1x1_bn", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "axis": 4, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["Conv3d_3b_1a_1x1_conv", 0, 0, {}]]], "name": "Conv3d_3b_1a_1x1_bn"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "Conv3d_3b_2a_1x1_bn", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "axis": 4, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["Conv3d_3b_2a_1x1_conv", 0, 0, {}]]], "name": "Conv3d_3b_2a_1x1_bn"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": false, "name": "Conv3d_3b_1a_1x1"}, "inbound_nodes": [[["Conv3d_3b_1a_1x1_bn", 0, 0, {}]]], "name": "Conv3d_3b_1a_1x1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": false, "name": "Conv3d_3b_2a_1x1"}, "inbound_nodes": [[["Conv3d_3b_2a_1x1_bn", 0, 0, {}]]], "name": "Conv3d_3b_2a_1x1"}, {"class_name": "MaxPooling3D", "config": {"name": "MaxPool2d_3b_3a_3x3", "trainable": false, "data_format": "channels_last", "pool_size": [3, 3, 3], "padding": "same", "strides": [1, 1, 1]}, "inbound_nodes": [[["MaxPool2d_3a_3x3", 0, 0, {}]]], "name": "MaxPool2d_3b_3a_3x3"}, {"class_name": "Conv3D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "Conv3d_3b_0a_1x1_conv", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": false, "data_format": "channels_last", "padding": "same", "strides": [1, 1, 1], "dilation_rate": [1, 1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1, 1]}, "inbound_nodes": [[["MaxPool2d_3a_3x3", 0, 0, {}]]], "name": "Conv3d_3b_0a_1x1_conv"}, {"class_name": "Conv3D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "Conv3d_3b_1b_3x3_conv", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": false, "data_format": "channels_last", "padding": "same", "strides": [1, 1, 1], "dilation_rate": [1, 1, 1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3, 3]}, "inbound_nodes": [[["Conv3d_3b_1a_1x1", 0, 0, {}]]], "name": "Conv3d_3b_1b_3x3_conv"}, {"class_name": "Conv3D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "Conv3d_3b_2b_3x3_conv", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": false, "data_format": "channels_last", "padding": "same", "strides": [1, 1, 1], "dilation_rate": [1, 1, 1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3, 3]}, "inbound_nodes": [[["Conv3d_3b_2a_1x1", 0, 0, {}]]], "name": "Conv3d_3b_2b_3x3_conv"}, {"class_name": "Conv3D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "Conv3d_3b_3b_1x1_conv", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": false, "data_format": "channels_last", "padding": "same", "strides": [1, 1, 1], "dilation_rate": [1, 1, 1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1, 1]}, "inbound_nodes": [[["MaxPool2d_3b_3a_3x3", 0, 0, {}]]], "name": "Conv3d_3b_3b_1x1_conv"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "Conv3d_3b_0a_1x1_bn", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "axis": 4, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["Conv3d_3b_0a_1x1_conv", 0, 0, {}]]], "name": "Conv3d_3b_0a_1x1_bn"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "Conv3d_3b_1b_3x3_bn", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "axis": 4, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["Conv3d_3b_1b_3x3_conv", 0, 0, {}]]], "name": "Conv3d_3b_1b_3x3_bn"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "Conv3d_3b_2b_3x3_bn", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "axis": 4, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["Conv3d_3b_2b_3x3_conv", 0, 0, {}]]], "name": "Conv3d_3b_2b_3x3_bn"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "Conv3d_3b_3b_1x1_bn", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "axis": 4, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["Conv3d_3b_3b_1x1_conv", 0, 0, {}]]], "name": "Conv3d_3b_3b_1x1_bn"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": false, "name": "Conv3d_3b_0a_1x1"}, "inbound_nodes": [[["Conv3d_3b_0a_1x1_bn", 0, 0, {}]]], "name": "Conv3d_3b_0a_1x1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": false, "name": "Conv3d_3b_1b_3x3"}, "inbound_nodes": [[["Conv3d_3b_1b_3x3_bn", 0, 0, {}]]], "name": "Conv3d_3b_1b_3x3"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": false, "name": "Conv3d_3b_2b_3x3"}, "inbound_nodes": [[["Conv3d_3b_2b_3x3_bn", 0, 0, {}]]], "name": "Conv3d_3b_2b_3x3"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": false, "name": "Conv3d_3b_3b_1x1"}, "inbound_nodes": [[["Conv3d_3b_3b_1x1_bn", 0, 0, {}]]], "name": "Conv3d_3b_3b_1x1"}, {"class_name": "Concatenate", "config": {"trainable": false, "name": "Mixed_3b", "axis": 4}, "inbound_nodes": [[["Conv3d_3b_0a_1x1", 0, 0, {}], ["Conv3d_3b_1b_3x3", 0, 0, {}], ["Conv3d_3b_2b_3x3", 0, 0, {}], ["Conv3d_3b_3b_1x1", 0, 0, {}]]], "name": "Mixed_3b"}, {"class_name": "Conv3D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "Conv3d_3c_1a_1x1_conv", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": false, "data_format": "channels_last", "padding": "same", "strides": [1, 1, 1], "dilation_rate": [1, 1, 1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1, 1]}, "inbound_nodes": [[["Mixed_3b", 0, 0, {}]]], "name": "Conv3d_3c_1a_1x1_conv"}, {"class_name": "Conv3D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "Conv3d_3c_2a_1x1_conv", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": false, "data_format": "channels_last", "padding": "same", "strides": [1, 1, 1], "dilation_rate": [1, 1, 1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1, 1]}, "inbound_nodes": [[["Mixed_3b", 0, 0, {}]]], "name": "Conv3d_3c_2a_1x1_conv"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "Conv3d_3c_1a_1x1_bn", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "axis": 4, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["Conv3d_3c_1a_1x1_conv", 0, 0, {}]]], "name": "Conv3d_3c_1a_1x1_bn"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "Conv3d_3c_2a_1x1_bn", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "axis": 4, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["Conv3d_3c_2a_1x1_conv", 0, 0, {}]]], "name": "Conv3d_3c_2a_1x1_bn"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": false, "name": "Conv3d_3c_1a_1x1"}, "inbound_nodes": [[["Conv3d_3c_1a_1x1_bn", 0, 0, {}]]], "name": "Conv3d_3c_1a_1x1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": false, "name": "Conv3d_3c_2a_1x1"}, "inbound_nodes": [[["Conv3d_3c_2a_1x1_bn", 0, 0, {}]]], "name": "Conv3d_3c_2a_1x1"}, {"class_name": "MaxPooling3D", "config": {"name": "MaxPool2d_3c_3a_3x3", "trainable": false, "data_format": "channels_last", "pool_size": [3, 3, 3], "padding": "same", "strides": [1, 1, 1]}, "inbound_nodes": [[["Mixed_3b", 0, 0, {}]]], "name": "MaxPool2d_3c_3a_3x3"}, {"class_name": "Conv3D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "Conv3d_3c_0a_1x1_conv", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": false, "data_format": "channels_last", "padding": "same", "strides": [1, 1, 1], "dilation_rate": [1, 1, 1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1, 1]}, "inbound_nodes": [[["Mixed_3b", 0, 0, {}]]], "name": "Conv3d_3c_0a_1x1_conv"}, {"class_name": "Conv3D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "Conv3d_3c_1b_3x3_conv", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": false, "data_format": "channels_last", "padding": "same", "strides": [1, 1, 1], "dilation_rate": [1, 1, 1], "kernel_regularizer": null, "filters": 192, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3, 3]}, "inbound_nodes": [[["Conv3d_3c_1a_1x1", 0, 0, {}]]], "name": "Conv3d_3c_1b_3x3_conv"}, {"class_name": "Conv3D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "Conv3d_3c_2b_3x3_conv", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": false, "data_format": "channels_last", "padding": "same", "strides": [1, 1, 1], "dilation_rate": [1, 1, 1], "kernel_regularizer": null, "filters": 96, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3, 3]}, "inbound_nodes": [[["Conv3d_3c_2a_1x1", 0, 0, {}]]], "name": "Conv3d_3c_2b_3x3_conv"}, {"class_name": "Conv3D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "Conv3d_3c_3b_1x1_conv", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": false, "data_format": "channels_last", "padding": "same", "strides": [1, 1, 1], "dilation_rate": [1, 1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1, 1]}, "inbound_nodes": [[["MaxPool2d_3c_3a_3x3", 0, 0, {}]]], "name": "Conv3d_3c_3b_1x1_conv"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "Conv3d_3c_0a_1x1_bn", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "axis": 4, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["Conv3d_3c_0a_1x1_conv", 0, 0, {}]]], "name": "Conv3d_3c_0a_1x1_bn"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "Conv3d_3c_1b_3x3_bn", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "axis": 4, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["Conv3d_3c_1b_3x3_conv", 0, 0, {}]]], "name": "Conv3d_3c_1b_3x3_bn"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "Conv3d_3c_2b_3x3_bn", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "axis": 4, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["Conv3d_3c_2b_3x3_conv", 0, 0, {}]]], "name": "Conv3d_3c_2b_3x3_bn"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "Conv3d_3c_3b_1x1_bn", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "axis": 4, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["Conv3d_3c_3b_1x1_conv", 0, 0, {}]]], "name": "Conv3d_3c_3b_1x1_bn"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": false, "name": "Conv3d_3c_0a_1x1"}, "inbound_nodes": [[["Conv3d_3c_0a_1x1_bn", 0, 0, {}]]], "name": "Conv3d_3c_0a_1x1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": false, "name": "Conv3d_3c_1b_3x3"}, "inbound_nodes": [[["Conv3d_3c_1b_3x3_bn", 0, 0, {}]]], "name": "Conv3d_3c_1b_3x3"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": false, "name": "Conv3d_3c_2b_3x3"}, "inbound_nodes": [[["Conv3d_3c_2b_3x3_bn", 0, 0, {}]]], "name": "Conv3d_3c_2b_3x3"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": false, "name": "Conv3d_3c_3b_1x1"}, "inbound_nodes": [[["Conv3d_3c_3b_1x1_bn", 0, 0, {}]]], "name": "Conv3d_3c_3b_1x1"}, {"class_name": "Concatenate", "config": {"trainable": false, "name": "Mixed_3c", "axis": 4}, "inbound_nodes": [[["Conv3d_3c_0a_1x1", 0, 0, {}], ["Conv3d_3c_1b_3x3", 0, 0, {}], ["Conv3d_3c_2b_3x3", 0, 0, {}], ["Conv3d_3c_3b_1x1", 0, 0, {}]]], "name": "Mixed_3c"}, {"class_name": "MaxPooling3D", "config": {"name": "MaxPool2d_4a_3x3", "trainable": false, "data_format": "channels_last", "pool_size": [3, 3, 3], "padding": "same", "strides": [2, 2, 2]}, "inbound_nodes": [[["Mixed_3c", 0, 0, {}]]], "name": "MaxPool2d_4a_3x3"}, {"class_name": "Conv3D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "Conv3d_4b_1a_1x1_conv", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": false, "data_format": "channels_last", "padding": "same", "strides": [1, 1, 1], "dilation_rate": [1, 1, 1], "kernel_regularizer": null, "filters": 96, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1, 1]}, "inbound_nodes": [[["MaxPool2d_4a_3x3", 0, 0, {}]]], "name": "Conv3d_4b_1a_1x1_conv"}, {"class_name": "Conv3D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "Conv3d_4b_2a_1x1_conv", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": false, "data_format": "channels_last", "padding": "same", "strides": [1, 1, 1], "dilation_rate": [1, 1, 1], "kernel_regularizer": null, "filters": 16, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1, 1]}, "inbound_nodes": [[["MaxPool2d_4a_3x3", 0, 0, {}]]], "name": "Conv3d_4b_2a_1x1_conv"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "Conv3d_4b_1a_1x1_bn", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "axis": 4, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["Conv3d_4b_1a_1x1_conv", 0, 0, {}]]], "name": "Conv3d_4b_1a_1x1_bn"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "Conv3d_4b_2a_1x1_bn", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "axis": 4, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["Conv3d_4b_2a_1x1_conv", 0, 0, {}]]], "name": "Conv3d_4b_2a_1x1_bn"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": false, "name": "Conv3d_4b_1a_1x1"}, "inbound_nodes": [[["Conv3d_4b_1a_1x1_bn", 0, 0, {}]]], "name": "Conv3d_4b_1a_1x1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": false, "name": "Conv3d_4b_2a_1x1"}, "inbound_nodes": [[["Conv3d_4b_2a_1x1_bn", 0, 0, {}]]], "name": "Conv3d_4b_2a_1x1"}, {"class_name": "MaxPooling3D", "config": {"name": "MaxPool2d_4b_3a_3x3", "trainable": false, "data_format": "channels_last", "pool_size": [3, 3, 3], "padding": "same", "strides": [1, 1, 1]}, "inbound_nodes": [[["MaxPool2d_4a_3x3", 0, 0, {}]]], "name": "MaxPool2d_4b_3a_3x3"}, {"class_name": "Conv3D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "Conv3d_4b_0a_1x1_conv", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": false, "data_format": "channels_last", "padding": "same", "strides": [1, 1, 1], "dilation_rate": [1, 1, 1], "kernel_regularizer": null, "filters": 192, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1, 1]}, "inbound_nodes": [[["MaxPool2d_4a_3x3", 0, 0, {}]]], "name": "Conv3d_4b_0a_1x1_conv"}, {"class_name": "Conv3D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "Conv3d_4b_1b_3x3_conv", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": false, "data_format": "channels_last", "padding": "same", "strides": [1, 1, 1], "dilation_rate": [1, 1, 1], "kernel_regularizer": null, "filters": 208, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3, 3]}, "inbound_nodes": [[["Conv3d_4b_1a_1x1", 0, 0, {}]]], "name": "Conv3d_4b_1b_3x3_conv"}, {"class_name": "Conv3D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "Conv3d_4b_2b_3x3_conv", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": false, "data_format": "channels_last", "padding": "same", "strides": [1, 1, 1], "dilation_rate": [1, 1, 1], "kernel_regularizer": null, "filters": 48, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3, 3]}, "inbound_nodes": [[["Conv3d_4b_2a_1x1", 0, 0, {}]]], "name": "Conv3d_4b_2b_3x3_conv"}, {"class_name": "Conv3D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "Conv3d_4b_3b_1x1_conv", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": false, "data_format": "channels_last", "padding": "same", "strides": [1, 1, 1], "dilation_rate": [1, 1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1, 1]}, "inbound_nodes": [[["MaxPool2d_4b_3a_3x3", 0, 0, {}]]], "name": "Conv3d_4b_3b_1x1_conv"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "Conv3d_4b_0a_1x1_bn", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "axis": 4, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["Conv3d_4b_0a_1x1_conv", 0, 0, {}]]], "name": "Conv3d_4b_0a_1x1_bn"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "Conv3d_4b_1b_3x3_bn", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "axis": 4, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["Conv3d_4b_1b_3x3_conv", 0, 0, {}]]], "name": "Conv3d_4b_1b_3x3_bn"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "Conv3d_4b_2b_3x3_bn", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "axis": 4, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["Conv3d_4b_2b_3x3_conv", 0, 0, {}]]], "name": "Conv3d_4b_2b_3x3_bn"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "Conv3d_4b_3b_1x1_bn", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "axis": 4, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["Conv3d_4b_3b_1x1_conv", 0, 0, {}]]], "name": "Conv3d_4b_3b_1x1_bn"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": false, "name": "Conv3d_4b_0a_1x1"}, "inbound_nodes": [[["Conv3d_4b_0a_1x1_bn", 0, 0, {}]]], "name": "Conv3d_4b_0a_1x1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": false, "name": "Conv3d_4b_1b_3x3"}, "inbound_nodes": [[["Conv3d_4b_1b_3x3_bn", 0, 0, {}]]], "name": "Conv3d_4b_1b_3x3"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": false, "name": "Conv3d_4b_2b_3x3"}, "inbound_nodes": [[["Conv3d_4b_2b_3x3_bn", 0, 0, {}]]], "name": "Conv3d_4b_2b_3x3"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": false, "name": "Conv3d_4b_3b_1x1"}, "inbound_nodes": [[["Conv3d_4b_3b_1x1_bn", 0, 0, {}]]], "name": "Conv3d_4b_3b_1x1"}, {"class_name": "Concatenate", "config": {"trainable": false, "name": "Mixed_4b", "axis": 4}, "inbound_nodes": [[["Conv3d_4b_0a_1x1", 0, 0, {}], ["Conv3d_4b_1b_3x3", 0, 0, {}], ["Conv3d_4b_2b_3x3", 0, 0, {}], ["Conv3d_4b_3b_1x1", 0, 0, {}]]], "name": "Mixed_4b"}, {"class_name": "Conv3D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "Conv3d_4c_1a_1x1_conv", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": false, "data_format": "channels_last", "padding": "same", "strides": [1, 1, 1], "dilation_rate": [1, 1, 1], "kernel_regularizer": null, "filters": 112, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1, 1]}, "inbound_nodes": [[["Mixed_4b", 0, 0, {}]]], "name": "Conv3d_4c_1a_1x1_conv"}, {"class_name": "Conv3D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "Conv3d_4c_2a_1x1_conv", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": false, "data_format": "channels_last", "padding": "same", "strides": [1, 1, 1], "dilation_rate": [1, 1, 1], "kernel_regularizer": null, "filters": 24, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1, 1]}, "inbound_nodes": [[["Mixed_4b", 0, 0, {}]]], "name": "Conv3d_4c_2a_1x1_conv"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "Conv3d_4c_1a_1x1_bn", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "axis": 4, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["Conv3d_4c_1a_1x1_conv", 0, 0, {}]]], "name": "Conv3d_4c_1a_1x1_bn"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "Conv3d_4c_2a_1x1_bn", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "axis": 4, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["Conv3d_4c_2a_1x1_conv", 0, 0, {}]]], "name": "Conv3d_4c_2a_1x1_bn"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": false, "name": "Conv3d_4c_1a_1x1"}, "inbound_nodes": [[["Conv3d_4c_1a_1x1_bn", 0, 0, {}]]], "name": "Conv3d_4c_1a_1x1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": false, "name": "Conv3d_4c_2a_1x1"}, "inbound_nodes": [[["Conv3d_4c_2a_1x1_bn", 0, 0, {}]]], "name": "Conv3d_4c_2a_1x1"}, {"class_name": "MaxPooling3D", "config": {"name": "MaxPool2d_4c_3a_3x3", "trainable": false, "data_format": "channels_last", "pool_size": [3, 3, 3], "padding": "same", "strides": [1, 1, 1]}, "inbound_nodes": [[["Mixed_4b", 0, 0, {}]]], "name": "MaxPool2d_4c_3a_3x3"}, {"class_name": "Conv3D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "Conv3d_4c_0a_1x1_conv", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": false, "data_format": "channels_last", "padding": "same", "strides": [1, 1, 1], "dilation_rate": [1, 1, 1], "kernel_regularizer": null, "filters": 160, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1, 1]}, "inbound_nodes": [[["Mixed_4b", 0, 0, {}]]], "name": "Conv3d_4c_0a_1x1_conv"}, {"class_name": "Conv3D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "Conv3d_4c_1b_3x3_conv", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": false, "data_format": "channels_last", "padding": "same", "strides": [1, 1, 1], "dilation_rate": [1, 1, 1], "kernel_regularizer": null, "filters": 224, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3, 3]}, "inbound_nodes": [[["Conv3d_4c_1a_1x1", 0, 0, {}]]], "name": "Conv3d_4c_1b_3x3_conv"}, {"class_name": "Conv3D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "Conv3d_4c_2b_3x3_conv", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": false, "data_format": "channels_last", "padding": "same", "strides": [1, 1, 1], "dilation_rate": [1, 1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3, 3]}, "inbound_nodes": [[["Conv3d_4c_2a_1x1", 0, 0, {}]]], "name": "Conv3d_4c_2b_3x3_conv"}, {"class_name": "Conv3D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "Conv3d_4c_3b_1x1_conv", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": false, "data_format": "channels_last", "padding": "same", "strides": [1, 1, 1], "dilation_rate": [1, 1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1, 1]}, "inbound_nodes": [[["MaxPool2d_4c_3a_3x3", 0, 0, {}]]], "name": "Conv3d_4c_3b_1x1_conv"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "Conv3d_4c_0a_1x1_bn", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "axis": 4, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["Conv3d_4c_0a_1x1_conv", 0, 0, {}]]], "name": "Conv3d_4c_0a_1x1_bn"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "Conv3d_4c_1b_3x3_bn", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "axis": 4, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["Conv3d_4c_1b_3x3_conv", 0, 0, {}]]], "name": "Conv3d_4c_1b_3x3_bn"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "Conv3d_4c_2b_3x3_bn", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "axis": 4, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["Conv3d_4c_2b_3x3_conv", 0, 0, {}]]], "name": "Conv3d_4c_2b_3x3_bn"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "Conv3d_4c_3b_1x1_bn", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "axis": 4, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["Conv3d_4c_3b_1x1_conv", 0, 0, {}]]], "name": "Conv3d_4c_3b_1x1_bn"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": false, "name": "Conv3d_4c_0a_1x1"}, "inbound_nodes": [[["Conv3d_4c_0a_1x1_bn", 0, 0, {}]]], "name": "Conv3d_4c_0a_1x1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": false, "name": "Conv3d_4c_1b_3x3"}, "inbound_nodes": [[["Conv3d_4c_1b_3x3_bn", 0, 0, {}]]], "name": "Conv3d_4c_1b_3x3"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": false, "name": "Conv3d_4c_2b_3x3"}, "inbound_nodes": [[["Conv3d_4c_2b_3x3_bn", 0, 0, {}]]], "name": "Conv3d_4c_2b_3x3"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": false, "name": "Conv3d_4c_3b_1x1"}, "inbound_nodes": [[["Conv3d_4c_3b_1x1_bn", 0, 0, {}]]], "name": "Conv3d_4c_3b_1x1"}, {"class_name": "Concatenate", "config": {"trainable": false, "name": "Mixed_4c", "axis": 4}, "inbound_nodes": [[["Conv3d_4c_0a_1x1", 0, 0, {}], ["Conv3d_4c_1b_3x3", 0, 0, {}], ["Conv3d_4c_2b_3x3", 0, 0, {}], ["Conv3d_4c_3b_1x1", 0, 0, {}]]], "name": "Mixed_4c"}, {"class_name": "Conv3D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "Conv3d_4d_1a_1x1_conv", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": false, "data_format": "channels_last", "padding": "same", "strides": [1, 1, 1], "dilation_rate": [1, 1, 1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1, 1]}, "inbound_nodes": [[["Mixed_4c", 0, 0, {}]]], "name": "Conv3d_4d_1a_1x1_conv"}, {"class_name": "Conv3D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "Conv3d_4d_2a_1x1_conv", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": false, "data_format": "channels_last", "padding": "same", "strides": [1, 1, 1], "dilation_rate": [1, 1, 1], "kernel_regularizer": null, "filters": 24, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1, 1]}, "inbound_nodes": [[["Mixed_4c", 0, 0, {}]]], "name": "Conv3d_4d_2a_1x1_conv"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "Conv3d_4d_1a_1x1_bn", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "axis": 4, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["Conv3d_4d_1a_1x1_conv", 0, 0, {}]]], "name": "Conv3d_4d_1a_1x1_bn"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "Conv3d_4d_2a_1x1_bn", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "axis": 4, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["Conv3d_4d_2a_1x1_conv", 0, 0, {}]]], "name": "Conv3d_4d_2a_1x1_bn"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": false, "name": "Conv3d_4d_1a_1x1"}, "inbound_nodes": [[["Conv3d_4d_1a_1x1_bn", 0, 0, {}]]], "name": "Conv3d_4d_1a_1x1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": false, "name": "Conv3d_4d_2a_1x1"}, "inbound_nodes": [[["Conv3d_4d_2a_1x1_bn", 0, 0, {}]]], "name": "Conv3d_4d_2a_1x1"}, {"class_name": "MaxPooling3D", "config": {"name": "MaxPool2d_4d_3a_3x3", "trainable": false, "data_format": "channels_last", "pool_size": [3, 3, 3], "padding": "same", "strides": [1, 1, 1]}, "inbound_nodes": [[["Mixed_4c", 0, 0, {}]]], "name": "MaxPool2d_4d_3a_3x3"}, {"class_name": "Conv3D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "Conv3d_4d_0a_1x1_conv", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": false, "data_format": "channels_last", "padding": "same", "strides": [1, 1, 1], "dilation_rate": [1, 1, 1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1, 1]}, "inbound_nodes": [[["Mixed_4c", 0, 0, {}]]], "name": "Conv3d_4d_0a_1x1_conv"}, {"class_name": "Conv3D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "Conv3d_4d_1b_3x3_conv", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": false, "data_format": "channels_last", "padding": "same", "strides": [1, 1, 1], "dilation_rate": [1, 1, 1], "kernel_regularizer": null, "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3, 3]}, "inbound_nodes": [[["Conv3d_4d_1a_1x1", 0, 0, {}]]], "name": "Conv3d_4d_1b_3x3_conv"}, {"class_name": "Conv3D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "Conv3d_4d_2b_3x3_conv", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": false, "data_format": "channels_last", "padding": "same", "strides": [1, 1, 1], "dilation_rate": [1, 1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3, 3]}, "inbound_nodes": [[["Conv3d_4d_2a_1x1", 0, 0, {}]]], "name": "Conv3d_4d_2b_3x3_conv"}, {"class_name": "Conv3D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "Conv3d_4d_3b_1x1_conv", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": false, "data_format": "channels_last", "padding": "same", "strides": [1, 1, 1], "dilation_rate": [1, 1, 1], "kernel_regularizer": null,